app/controllers/words_controller.rb

INSERT INTO "words" ("conjunction", "created_at", "updated_at") VALUES (?, ?, ?)  [["conjunction", "さらに"], ["created_at", "2016-03-06 07:23:10.123929"], ["updated_at", "2016-03-06 07:23:10.123929"]]
---
  def create
    @word = Word.new(word_params)

    respond_to do |format|
      if @word.save

DELETE FROM "words" WHERE "words"."id" = ?  [["id", 1]]
---
  def destroy
    @word.destroy

SELECT  "words".* FROM "words"  ORDER BY RANDOM() LIMIT 1
---
  def getrandom
    @word = Word.order("RANDOM()").first

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_word
      @word = Word.find(params[:id])